In [21]:
# Importando as bibliotecas que serão utilizadas para popular as tabelas do projeto.

import pandas as pd
import pymysql as sql
import csv

In [22]:
# Lendo o arquivo .csv

df_tab_aviao = pd.read_csv('tab_aviao.csv', delimiter=';')
df_tab_aviao.head()

   cod_aviao modelo_aviao  valor_aviao
0       1003      EMB-110      5926920
1       1001      EMB-100      5420874
2       1005     EMB-110C      6142896
3       1006     EMB-110E      5987430
4       1007     EMB-110F      5845634

In [23]:
# Cria conexão com MySQL, passando os parâmetros(servidor, senha e database)

conexao = sql.connect(host='localhost', user='root', password='admin', database='projetointegrador')

In [24]:
# Criando um cursor e executando um loop no dataframe para fazer o INSERT no banco de dados

cursor = conexao.cursor()

for index, row in df_tab_aviao.iterrows():
    sql = "INSERT INTO tab_aviao (cod_aviao, modelo_aviao, valor_aviao) VALUES (%s, %s, %s)"
    val = (row['cod_aviao'],row['modelo_aviao'],row['valor_aviao'])
    cursor.execute(sql, val)
    conexao.commit()
cursor.close()
conexao.close()